def get_change(n):
    if (1000-n) // 500 >= 0:
        print((1000-n) // 500, end=' ')
    if ((1000-n)%500) // 100 >= 0:
        print(((1000-n)%500) // 100, end=' ')
    if ((1000-n)%100) // 50 >= 0:
        print(((1000-n)%100) // 50, end=' ')
    if ((1000-n)%50) // 10 >= 0:
        print(((1000-n)%50) // 10, end=' ')
    if ((1000-n)%10) // 5 >= 0:
        print(((1000-n)%10) // 5, end=' ')
    if ((1000-n)%5) // 1 >= 0:
        print(((1000-n)%5) // 1, end='')

def main():
    a = int(input("請輸入1~1000之間的消費金額:"))
    get_change(a)

main()